content/post/2018-11-16-the-top-mustache-extension-in-cfengine-3.org
#+Title: The -top- mustache extension in CFEngine 3
#+AUTHOR: Nick Anderson
#+DATE: 2018-11-13
#+TAGS: cfengine3 cfengine mustache
#+DRAFT: false

#+BEGIN_QUOTE
  What is the =-top-= extension, and how do I use it in CFEngines Mustache templating method?
#+END_QUOTE

The =-top-= extension to the mustache template method, first introduced in
CFEngine 3.9.0, is a special key representing the complete data given to the
templating engine. This is useful for iterating over the top level of a
container ={{#-top-}}= ... ={{/-top-}}= and rendering json representation of
data given with =$= and =%=. Note, when iterating over =-top-= you can expand
the current iterations key with =@= and value with =.=.

Let's take a look at a couple small examples:

