2018/11/16/the-top-mustache-extension-in-cfengine-3/index.html
<!DOCTYPE html>
<html>

    <head>
        <title> The -top- mustache extension in CFEngine 3 &middot;  </title>

        <meta http-equiv="content-type" content="text/html; charset=utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="generator" content="Hugo 0.123.7">






<link href="https://cdn.jsdelivr.net/npm/bootstrap@5.0.1/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-+0n0xVW2eSR5OomGNYDnhzAbDsOXxcvSN1TPprVMTNDbiYZCxYbOOl7+AMvyTG2x" crossorigin="anonymous">


<link rel="stylesheet" href="https://use.fontawesome.com/releases/v5.7.2/css/all.css" integrity="sha384-fnmOCqbTlWIlj8LyTjo7mOUStjsKC4pOpQbqyi7RrhN7udi9RwhKkMHpvLbHG9Sr" crossorigin="anonymous">


<link rel="stylesheet" href="https://cmdln.org/css/nix.css">





<link href="https://fonts.googleapis.com/css?family=Inconsolata%7COpen+Sans%7CConcert+One" rel="stylesheet">






    </head>

    <body>
        <header>
	<nav class="navbar navbar-dark bg-dark fixed-top navbar-expand-lg font-header">
		<div class="container-fluid">
			<a class="navbar-brand" id="green-terminal" href='https://cmdln.org/'>
				nick@cmdln.org ~ $
			</a>
			<button type="button" class="navbar-toggler" data-bs-toggle="collapse" data-bs-target="#navbar-collapse-1" 
					aria-controls="navbar-collapse-1" aria-expanded="false">
				<span class="visually-hidden">Toggle navigation</span>
				<span class="navbar-toggler-icon"></span>
			</button>
	
			
			<div class="collapse navbar-collapse" id="navbar-collapse-1">
				<ul class="nav navbar-nav ms-auto">
					<li class="nav-item">
						<a class="nav-link" href='https://cmdln.org/'>
							/home/nick</a>
					</li>
					
					
					
					<li class="nav-item dropdown">
						
						<a class="nav-link" href="https://cmdln.org/post/">~/posts</a>
						
					</li>
					
				</ul>
			</div>
		</div>
	</nav>
</header>

        <div class="flex-wrapper">
            <div class="container wrapper">
                <h1><a href="https://cmdln.org/2018/11/16/the-top-mustache-extension-in-cfengine-3/">The -top- mustache extension in CFEngine 3</a></h1>
                <span class="post-date">2018-11-16 </span>
                <div class="post-content">
                    
<blockquote>
<p>What is the <code class="verbatim">-top-</code> extension, and how do I use it in CFEngines Mustache templating method?</p>
</blockquote>
<p>
The <code class="verbatim">-top-</code> extension to the mustache template method, first introduced in
CFEngine 3.9.0, is a special key representing the complete data given to the
templating engine. This is useful for iterating over the top level of a
container <code class="verbatim">{{#-top-}}</code> … <code class="verbatim">{{/-top-}}</code> and rendering json representation of
data given with <code class="verbatim">$</code> and <code class="verbatim">%</code>. Note, when iterating over <code class="verbatim">-top-</code> you can expand
the current iterations key with <code class="verbatim">@</code> and value with <code class="verbatim">.</code>.</p>
<p>
Let&#39;s take a look at a couple small examples:</p>
