content/post/2018-11-16-the-top-mustache-extension-in-cfengine-3.org
* Iterating over -top- for rendering simple key=value configuration files
Many configuration file formats like =/etc/sysctl.conf= are simple key = value.

In this example, we see how data for =/etc/sysctl.conf= can be modeled for simple
rendering using =-top-=.

#+NAME: Iterate over -top- key (@) values (.)
#+CAPTION: Iterate over -top- key (@) values (.)
#+BEGIN_SRC cfengine3 :exports both :results output
  bundle agent main
  {
    vars:

        # A simple data structure holding sysctl keys and values
        "c" data => '{
    "net.ipv6.conf.forwarding": "0",
    "net.ipv6.conf.all.forwarding": "0",
    "fs.protected_hardlinks": "1",
    "fs.protected_symlinks": "1",
    "vm.swappiness": "10"
  }';

    reports:
        "CFEngine $(sys.cf_version)";

        # A report to see what a rendered file would look like
        "/etc/sysctl.conf$(const.n)$(with)"
          with => string_mustache( "# Rendered by CFEngine$(const.n){{#-top-}}{{{@}}}={{{.}}}$(const.n){{/-top-}}",
                                   c);
  }
#+END_SRC

Let's break it down:
- On line 6-12 we define =c= as data container with inline JSON. Note, there are
  many alternative ways that data can be defined, see [[https://docs.cfengine.com/docs/3.12/reference-functions-readjson.html][readjson()]], [[https://docs.cfengine.com/docs/3.12/reference-functions-readyaml.html][readyaml()]],
  [[https://docs.cfengine.com/docs/3.12/reference-functions-readenvfile.html][readenvfile()]], [[https://docs.cfengine.com/docs/3.12/reference-functions-readdata.html][readdata()]].
- On line 18 we promise to report the name of our example file (
  =/etc/sysctl.conf= )followed by a newline ( [[https://docs.cfengine.com/docs/3.12/reference-special-variables-const.html#const-n][$(const.n)]] ), followed by a
  string which is rendered from a mustache template via the [[https://docs.cfengine.com/docs/3.12/reference-functions-string_mustache.html][string_mustache()]]
  function.

The above policy results in this output:

#+RESULTS: Iterate over -top- key (@) values (.)
: R: CFEngine 3.12.0
: R: /etc/sysctl.conf
: # Rendered by CFEngine
: net.ipv6.conf.forwarding=0
: net.ipv6.conf.all.forwarding=0
: fs.protected_hardlinks=1
: fs.protected_symlinks=1
: vm.swappiness=10
: 

It's easy to take this reports prototype and turn it into a real files promise.
Let's take this example one step further and make it a bit more practical.

#+NAME: Iterate over -top- key (@) values (.) and render a real file
#+CAPTION: Iterate over -top- key (@) values (.) and render a real file
#+BEGIN_SRC cfengine3 :exports both :results output
  bundle agent main
  {
    vars:

        # Let's make it easy for this policy to be applied to a temporary
        # location. Note, an empty string will result in no prefix. This is a
        # useful pattern when combined with classes.

        "PREFIX" string => "/tmp";

        # A simple data structure holding sysctl keys and values
        "c" data => '{
    "net.ipv6.conf.forwarding": "0",
    "net.ipv6.conf.all.forwarding": "0",
    "fs.protected_hardlinks": "1",
    "fs.protected_symlinks": "1",
    "vm.swappiness": "10"
  }';

    files:
        "$(PREFIX)/etc/sysctl.conf"
          create => "true",
          template_method => "inline_mustache",
          edit_template_string => "# Rendered by CFEngine$(const.n){{#-top-}}{{{@}}}={{{.}}}$(const.n){{/-top-}}",
          template_data => @(c);


    reports:
        "CFEngine $(sys.cf_version)";

        # A report to see what a rendered file would look like
        "${PREFIX}/etc/sysctl.conf"
          printfile => cat( $(this.promiser) );
  }
#+END_SRC

Here is the policy output:

#+RESULTS: Iterate over -top- key (@) values (.) and render a real file
: R: CFEngine 3.12.0
: R: /tmp/etc/sysctl.conf
: R: # Rendered by CFEngine
: R: net.ipv6.conf.forwarding=0
: R: net.ipv6.conf.all.forwarding=0
: R: fs.protected_hardlinks=1
: R: fs.protected_symlinks=1
: R: vm.swappiness=10

