2018/11/16/the-top-mustache-extension-in-cfengine-3/index.html
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Iterating over -top- for rendering simple key=value configuration files
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>Many configuration file formats like <code class="verbatim">/etc/sysctl.conf</code> are simple key = value.</p>
<p>
In this example, we see how data for <code class="verbatim">/etc/sysctl.conf</code> can be modeled for simple
rendering using <code class="verbatim">-top-</code>.</p>
<figure>
<div class="src src-cfengine3">
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt"> 1
</span><span class="lnt"> 2
</span><span class="lnt"> 3
</span><span class="lnt"> 4
</span><span class="lnt"> 5
</span><span class="lnt"> 6
</span><span class="lnt"> 7
</span><span class="lnt"> 8
</span><span class="lnt"> 9
</span><span class="lnt">10
</span><span class="lnt">11
</span><span class="lnt">12
</span><span class="lnt">13
</span><span class="lnt">14
</span><span class="lnt">15
</span><span class="lnt">16
</span><span class="lnt">17
</span><span class="lnt">18
</span><span class="lnt">19
</span><span class="lnt">20
</span><span class="lnt">21
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-cfengine3" data-lang="cfengine3"><span class="line"><span class="cl">  <span class="k">bundle</span> <span class="k">agent</span> <span class="nf">main</span>
</span></span><span class="line"><span class="cl">  <span class="p">{</span>
</span></span><span class="line"><span class="cl">    <span class="kd">vars</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">        <span class="c"># A simple data structure holding sysctl keys and values
</span></span></span><span class="line"><span class="cl"><span class="c"></span>        <span class="s">&#34;c&#34;</span> <span class="kr">data</span> <span class="o">=&gt;</span> <span class="s">&#39;{
</span></span></span><span class="line"><span class="cl"><span class="s">    &#34;net.ipv6.conf.forwarding&#34;: &#34;0&#34;,
</span></span></span><span class="line"><span class="cl"><span class="s">    &#34;net.ipv6.conf.all.forwarding&#34;: &#34;0&#34;,
</span></span></span><span class="line"><span class="cl"><span class="s">    &#34;fs.protected_hardlinks&#34;: &#34;1&#34;,
</span></span></span><span class="line"><span class="cl"><span class="s">    &#34;fs.protected_symlinks&#34;: &#34;1&#34;,
</span></span></span><span class="line"><span class="cl"><span class="s">    &#34;vm.swappiness&#34;: &#34;10&#34;
</span></span></span><span class="line"><span class="cl"><span class="s">  }&#39;</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">    <span class="kd">reports</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">        <span class="s">&#34;CFEngine </span><span class="si">$(sys.cf_version)</span><span class="s">&#34;</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">        <span class="c"># A report to see what a rendered file would look like
</span></span></span><span class="line"><span class="cl"><span class="c"></span>        <span class="s">&#34;/etc/sysctl.conf</span><span class="si">$(const.n)$(with)</span><span class="s">&#34;</span>
</span></span><span class="line"><span class="cl">          <span class="kr">with</span> <span class="o">=&gt;</span> <span class="nf">string_mustache</span><span class="p">(</span> <span class="s">&#34;# Rendered by CFEngine</span><span class="si">$(const.n)</span><span class="s">{{#-top-}}{{{@}}}={{{.}}}</span><span class="si">$(const.n)</span><span class="s">{{/-top-}}&#34;</span><span class="p">,</span>
</span></span><span class="line"><span class="cl">                                   <span class="nf">c</span><span class="p">);</span>
</span></span><span class="line"><span class="cl">  <span class="p">}</span></span></span></code></pre></td></tr></table>
</div>
</div>
</div>
<figcaption>
Iterate over -top- key (@) values (.)
</figcaption>
</figure>
<p>
Let&#39;s break it down:</p>
<ul>
<li>On line 6-12 we define <code class="verbatim">c</code> as data container with inline JSON. Note, there are
many alternative ways that data can be defined, see <a href="https://docs.cfengine.com/docs/3.12/reference-functions-readjson.html">readjson()</a>, <a href="https://docs.cfengine.com/docs/3.12/reference-functions-readyaml.html">readyaml()</a>,
<a href="https://docs.cfengine.com/docs/3.12/reference-functions-readenvfile.html">readenvfile()</a>, <a href="https://docs.cfengine.com/docs/3.12/reference-functions-readdata.html">readdata()</a>.</li>
<li>On line 18 we promise to report the name of our example file (
<code class="verbatim">/etc/sysctl.conf</code> )followed by a newline ( <a href="https://docs.cfengine.com/docs/3.12/reference-special-variables-const.html#const-n">$(const.n)</a> ), followed by a
string which is rendered from a mustache template via the <a href="https://docs.cfengine.com/docs/3.12/reference-functions-string_mustache.html">string_mustache()</a>
function.</li>
</ul>
<p>The above policy results in this output:</p>
<pre class="example">
R: CFEngine 3.12.0
R: /etc/sysctl.conf
# Rendered by CFEngine
net.ipv6.conf.forwarding=0
net.ipv6.conf.all.forwarding=0
fs.protected_hardlinks=1
fs.protected_symlinks=1
vm.swappiness=10

</pre>
<p>
It&#39;s easy to take this reports prototype and turn it into a real files promise.
Let&#39;s take this example one step further and make it a bit more practical.</p>
<figure>
<div class="src src-cfengine3">
<div class="highlight"><div class="chroma">
<table class="lntable"><tr><td class="lntd">
<pre tabindex="0" class="chroma"><code><span class="lnt"> 1
</span><span class="lnt"> 2
</span><span class="lnt"> 3
</span><span class="lnt"> 4
</span><span class="lnt"> 5
</span><span class="lnt"> 6
</span><span class="lnt"> 7
</span><span class="lnt"> 8
</span><span class="lnt"> 9
</span><span class="lnt">10
</span><span class="lnt">11
</span><span class="lnt">12
</span><span class="lnt">13
</span><span class="lnt">14
</span><span class="lnt">15
</span><span class="lnt">16
</span><span class="lnt">17
</span><span class="lnt">18
</span><span class="lnt">19
</span><span class="lnt">20
</span><span class="lnt">21
</span><span class="lnt">22
</span><span class="lnt">23
</span><span class="lnt">24
</span><span class="lnt">25
</span><span class="lnt">26
</span><span class="lnt">27
</span><span class="lnt">28
</span><span class="lnt">29
</span><span class="lnt">30
</span><span class="lnt">31
</span><span class="lnt">32
</span><span class="lnt">33
</span><span class="lnt">34
</span></code></pre></td>
<td class="lntd">
<pre tabindex="0" class="chroma"><code class="language-cfengine3" data-lang="cfengine3"><span class="line"><span class="cl">  <span class="k">bundle</span> <span class="k">agent</span> <span class="nf">main</span>
</span></span><span class="line"><span class="cl">  <span class="p">{</span>
</span></span><span class="line"><span class="cl">    <span class="kd">vars</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">        <span class="c"># Let&#39;s make it easy for this policy to be applied to a temporary
</span></span></span><span class="line"><span class="cl"><span class="c"></span>        <span class="c"># location. Note, an empty string will result in no prefix. This is a
</span></span></span><span class="line"><span class="cl"><span class="c"></span>        <span class="c"># useful pattern when combined with classes.
</span></span></span><span class="line"><span class="cl"><span class="c"></span>
</span></span><span class="line"><span class="cl">        <span class="s">&#34;PREFIX&#34;</span> <span class="kr">string</span> <span class="o">=&gt;</span> <span class="s">&#34;/tmp&#34;</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">        <span class="c"># A simple data structure holding sysctl keys and values
</span></span></span><span class="line"><span class="cl"><span class="c"></span>        <span class="s">&#34;c&#34;</span> <span class="kr">data</span> <span class="o">=&gt;</span> <span class="s">&#39;{
</span></span></span><span class="line"><span class="cl"><span class="s">    &#34;net.ipv6.conf.forwarding&#34;: &#34;0&#34;,
</span></span></span><span class="line"><span class="cl"><span class="s">    &#34;net.ipv6.conf.all.forwarding&#34;: &#34;0&#34;,
</span></span></span><span class="line"><span class="cl"><span class="s">    &#34;fs.protected_hardlinks&#34;: &#34;1&#34;,
</span></span></span><span class="line"><span class="cl"><span class="s">    &#34;fs.protected_symlinks&#34;: &#34;1&#34;,
</span></span></span><span class="line"><span class="cl"><span class="s">    &#34;vm.swappiness&#34;: &#34;10&#34;
</span></span></span><span class="line"><span class="cl"><span class="s">  }&#39;</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">    <span class="kd">files</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">        <span class="s">&#34;</span><span class="si">$(PREFIX)</span><span class="s">/etc/sysctl.conf&#34;</span>
</span></span><span class="line"><span class="cl">          <span class="kr">create</span> <span class="o">=&gt;</span> <span class="s">&#34;true&#34;</span><span class="p">,</span>
</span></span><span class="line"><span class="cl">          <span class="kr">template_method</span> <span class="o">=&gt;</span> <span class="s">&#34;inline_mustache&#34;</span><span class="p">,</span>
</span></span><span class="line"><span class="cl">          <span class="kr">edit_template_string</span> <span class="o">=&gt;</span> <span class="s">&#34;# Rendered by CFEngine</span><span class="si">$(const.n)</span><span class="s">{{#-top-}}{{{@}}}={{{.}}}</span><span class="si">$(const.n)</span><span class="s">{{/-top-}}&#34;</span><span class="p">,</span>
</span></span><span class="line"><span class="cl">          <span class="kr">template_data</span> <span class="o">=&gt;</span> <span class="nv">@(c)</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">    <span class="kd">reports</span><span class="p">:</span>
</span></span><span class="line"><span class="cl">        <span class="s">&#34;CFEngine </span><span class="si">$(sys.cf_version)</span><span class="s">&#34;</span><span class="p">;</span>
</span></span><span class="line"><span class="cl">
</span></span><span class="line"><span class="cl">        <span class="c"># A report to see what a rendered file would look like
</span></span></span><span class="line"><span class="cl"><span class="c"></span>        <span class="s">&#34;</span><span class="si">${PREFIX}</span><span class="s">/etc/sysctl.conf&#34;</span>
</span></span><span class="line"><span class="cl">          <span class="kr">printfile</span> <span class="o">=&gt;</span> <span class="nf">cat</span><span class="p">(</span> <span class="nv">$(this.promiser)</span> <span class="p">);</span>
</span></span><span class="line"><span class="cl">  <span class="p">}</span></span></span></code></pre></td></tr></table>
</div>
</div>
</div>
<figcaption>
Iterate over -top- key (@) values (.) and render a real file
</figcaption>
</figure>
<p>
Here is the policy output:</p>
<pre class="example">
R: CFEngine 3.12.0
R: /tmp/etc/sysctl.conf
R: # Rendered by CFEngine
R: net.ipv6.conf.forwarding=0
R: net.ipv6.conf.all.forwarding=0
R: fs.protected_hardlinks=1
R: fs.protected_symlinks=1
R: vm.swappiness=10
</pre>
</div>
</div>
